Table of Contents
 Class Opening
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Representation of opening in IDEA StatiCa Detail
public class Opening : OpenElementId
Inheritance
object
OpenObject
OpenElementId
Opening
Derived
OpeningCirc
OpeningRect
OpeningRectOffsets
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 Opening()
Constructor
public Opening()
Properties
 GeomId
Id representing geometrical parts of Detail
public int GeomId { get; set; }
Property Value
int
 InsertPoint
Insert point 0 - 9
public int InsertPoint { get; set; }
Property Value
int
 MasterComponent
Master component
public ReferenceElement MasterComponent { get; set; }
Property Value
ReferenceElement
 MasterPoint
Master point 0 - 9
public int MasterPoint { get; set; }
Property Value
int
 Name
Name
public string Name { get; set; }
Property Value
string
 Outline
Outline of Oopening
public ReferenceElement Outline { get; set; }
Property Value
ReferenceElement
 Position
Offset between MasterPoint and InsertPoint If MasterPoint is null, position is from origin of coordinate system
public Vector3D Position { get; set; }
Property Value
Vector3D
 Edit this page